src/cfe/InformationRegisters/кб99_СоответствияТоваровЕИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>кб99_СоответствияТоваровЕИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрактныйТовар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.еисКонтрактныеТовары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/кб99_СоответствияТоваровЕИС/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьИзКонтрактногоТовара(Команда)
	
	ЗаполнитьИзКонтрактногоТовараНаСервере();
	Элементы.Список.Обновить();
	
	ПоказатьОповещениеПользователя("Выполнено");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзКонтрактногоТовараНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	еисКонтрактныеТовары.Ссылка КАК КонтрактныйТовар,
		|	еисКонтрактныеТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	Справочник.еисКонтрактныеТовары КАК еисКонтрактныеТовары
		|ГДЕ
		|	еисКонтрактныеТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяЗапись = РегистрыСведений.кб99_СоответствияТоваровЕИС.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
		НоваяЗапись.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры
